{
    "module": "keras.src.models.functional",
    "class_name": "Functional",
    "config": {
        "name": "functional_1",
        "trainable": true,
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_shape": [
                        null,
                        128,
                        128,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_layer"
                },
                "registered_name": null,
                "name": "input_layer",
                "inbound_nodes": []
            },
            {
                "module": "keras.layers",
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "conv1_pad",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        [
                            3,
                            3
                        ],
                        [
                            3,
                            3
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        128,
                        128,
                        3
                    ]
                },
                "name": "conv1_pad",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        128,
                                        128,
                                        3
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "input_layer",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv1_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        7,
                        7
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        134,
                        134,
                        3
                    ]
                },
                "name": "conv1_conv",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        134,
                                        134,
                                        3
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "conv1_pad",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "conv1_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.00001001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        64,
                        64,
                        64
                    ]
                },
                "name": "conv1_bn",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64,
                                        64,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "conv1_conv",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Activation",
                "config": {
                    "name": "conv1_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        64,
                        64,
                        64
                    ]
                },
                "name": "conv1_relu",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64,
                                        64,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "conv1_bn",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "pool1_pad",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        64,
                        64,
                        64
                    ]
                },
                "name": "pool1_pad",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64,
                                        64,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "conv1_relu",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "pool1_pool",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        3,
                        3
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        66,
                        66,
                        64
                    ]
                },
                "name": "pool1_pool",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        66,
                                        66,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "pool1_pad",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2_block1_1_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        64
                    ]
                },
                "name": "conv2_block1_1_conv",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32,
                                        32,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "pool1_pool",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "conv2_block1_1_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.00001001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        64
                    ]
                },
                "name": "conv2_block1_1_bn",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32,
                                        32,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "conv2_block1_1_conv",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Activation",
                "config": {
                    "name": "conv2_block1_1_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        64
                    ]
                },
                "name": "conv2_block1_1_relu",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32,
                                        32,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "conv2_block1_1_bn",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2_block1_2_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        64
                    ]
                },
                "name": "conv2_block1_2_conv",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32,
                                        32,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "conv2_block1_1_relu",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "conv2_block1_2_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.00001001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        64
                    ]
                },
                "name": "conv2_block1_2_bn",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32,
                                        32,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "conv2_block1_2_conv",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Activation",
                "config": {
                    "name": "conv2_block1_2_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        64
                    ]
                },
                "name": "conv2_block1_2_relu",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32,
                                        32,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "conv2_block1_2_bn",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2_block1_0_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        64
                    ]
                },
                "name": "conv2_block1_0_conv",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32,
                                        32,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "pool1_pool",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2_block1_3_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        64
                    ]
                },
                "name": "conv2_block1_3_conv",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32,
                                        32,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "conv2_block1_2_relu",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "conv2_block1_0_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.00001001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        256
                    ]
                },
                "name": "conv2_block1_0_bn",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32,
                                        32,
                                        256
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "conv2_block1_0_conv",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "conv2_block1_3_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.00001001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        256
                    ]
                },
                "name": "conv2_block1_3_bn",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32,
                                        32,
                                        256
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "conv2_block1_3_conv",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Add",
                "config": {
                    "name": "conv2_block1_add",
                    "trainable": true,
                    "dtype": "float32"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        [
                            null,
                            32,
                            32,
                            256
                        ],
                        [
                            null,
                            32,
                            32,
                            256
                        ]
                    ]
                },
                "name": "conv2_block1_add",
                "inbound_nodes": [
                    {
                        "args": [
                            [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            32,
                                            32,
                                            256
                                        ],
                                        "dtype": "float32",
                                        "keras_history": [
                                            "conv2_block1_0_bn",
                                            0,
                                            0
                                        ]
                                    }
                                },
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            32,
                                            32,
                                            256
                                        ],
                                        "dtype": "float32",
                                        "keras_history": [
                                            "conv2_block1_3_bn",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ]
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Activation",
                "config": {
                    "name": "conv2_block1_out",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        256
                    ]
                },
                "name": "conv2_block1_out",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32,
                                        32,
                                        256
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "conv2_block1_add",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2_block2_1_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        256
                    ]
                },
                "name": "conv2_block2_1_conv",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32,
                                        32,
                                        256
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "conv2_block1_out",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "conv2_block2_1_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.00001001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
